# FlipDirection Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConnectorElement..::..FlipDirection Method
ConnectorElement Class See Also
---
Reverses the direction of the connector element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void FlipDirection()
```

Visual Basic
---
```text
Public Sub FlipDirection
```

Visual C++
---
```text
public:
void FlipDirection()
```

# See Also
ConnectorElement Class
Autodesk.Revit.DB Namespace